//package com.lec.ex02_switch;
//
//public class Blog {
//
//	public static void main(String[] args) {
//		// TODO Auto-generated method stub
//
//  	if (조건식) {
//  	// 조건식이 참일 때 실행될 코드 블록
//   
////  	조건식은 참(true)또는 거짓(false)를 반환하는 표현식이어야 합니다. 조건식이 참일 경우에만
////  	해당 코드 블록이 실행된다. 예를 들어 다음 같은 코드를 보면
//  
//    int x = 10;
//
//     if (x > 5) {
//  	System.out.println("x는 5보다 큽니다.");
//}
//
////	위 코드에서는 변수 x의 값이 5보다 큰지 비교하는 조건식을 작성하였습니다. 조건식이
////	참이므로 해당 코드블록이 실행되어 "x는 5보다 큽니다."라는 문자열이 출력된다.
////	
////	if문은 else문과 함께 사용하여 조건식이 거짓일 때 실행될 코드 블록도 사용할 수 있다.
////	예를 들어
//	
//	int x = 3;
//
//	if (x > 5) {
//  	System.out.println("x는 5보다 큽니다.");
//	} else {
//  	System.out.println("x는 5보다 작거나 같습니다.");
//  	
////  	위 코드에서는 변수 x의 값이 5보다 작거나 같은지를 비교하는 조건식을 작성했다.
////    조건식이 거짓이므로 if문의 코드 블록은 실행되지 않고, 대신 else문의 코드 블록이 실행되어
////    "x는 5보다 작거나 같습니다." 라는 문자열이 출력된다.
////    마지막으로, if문은 else if문을 사용하여 여러 개의 조건식을 사용 할 수도 있다.
////    예를 들어
////    int x = 7;
//
//	if (x > 10) {
//  	System.out.println("x는 10보다 큽니다.");
//	} 	else if (x > 5) {
//  	System.out.println("x는 5보다 큽니다.");
//	} else {
//  	System.out.println("x는 5보다 작거나 같습니다.");
//}
//
//}
////	변수 x의 값이 10보다 큰지, 5보다 큰지, 또는 5보다 작거나 같은지를 검사하는 세 개의 조건식을 사용했다.
////	x의 값이 7이므로 두 번째 조건식이 참이 되어 해당 코드 블록이 실행되어 
////	"x는 5보다 큽니다." 라는 문자열이 출력이된다.
//
//   
//}
//
//
//	}
//
//}
