//package com.lec.ex03_for;
//
//public class ForBLog {
//
//	public static void main(String[] args) {
//		// TODO Auto-generated method stub
//		
//		for (초기식; 조건식; 증감식) {
//			  // 조건식이 참인 동안 실행될 코드 블록
//			}
//		
////		여기서 초기식은 반복문에서 사용할 변수를 초기화하는 부분이다. 
////		초기식은 반드시 하나 이상의 변수를 초기화해야 하며,
////		이때 초기식은 for문의 첫 번째 인자로 사용된다. 
////		조건식은 반복문이 실행될 조건을 정의하며, 
////		이 조건이 참인 동안 코드 블록이 반복해서 실행된다.
////		조건식이 false가 되면, 반복문이 종료가된다.
////		증감식은 조건식의 검사 후, 코드 블록이 실행될 때마다 실행되는 부분이다.
//
////		for문에서는 조건식에서 사용하는 변수의 값을 증가시키거나 감소시켜,
////		일정한 범위 내에서 코드 블록이 실행되도록 할 수 있다.
////		예를 들어, 다음은 1부터 10까지의 숫자를 출력하는 for문의 예시 코드이다.
//			
//			for (int i = 1; i <= 10; i++) {
//				  System.out.println(i);
//				}
////			위 코드에서는 i 변수를 초기값 1로 설정하고, i 변수가 10보다 작거나 같을 때까지 코드 블록을 반복해서 실행한다.
////			반복 실행 시마다 i 변수의 값을 1씩 증가시키며,
////			i 변수의 값이 10이 되면 조건식이 false가 되어 반복문이 종료된다.
//
////			또한, for문에서는 배열과 함께 사용하여 배열의 모든 요소를 반복해서 처리하는 경우에도 많이 사용된다고한다.
////			예를 들어, 다음은 배열의 모든 요소를 출력하는 for문의 예시 코드이다
//			
//			int[] arr = { 1, 2, 3, 4, 5 };
//
//			for (int i = 0; i < arr.length; i++) {
//			  System.out.println(arr[i]);
//			}
//			
////			위 코드에서는 배열의 인덱스 값을 i 변수에 저장하고,
////			i 변수가 배열의 길이보다 작을 때까지 반복해서 실행을한다.
////			반복 실행 시마다 i 변수의 값을 1씩 증가시켜, 배열의 모든 요소를 출력한다.
////
////			for문은 자바에서 가장 많이 사용되는 반복문 중 하나이며,
////			다양한 용도로 활용될 수 있다. 
////			이러한 for문의 특징과 사용 방법을 이해하고, 적절하게 활용하는 것이 중요하다.
////			자바에서 반복문과 조건문은 지금까지 내 경험으로써는 정말 많이 쓰인다.
////          그렇기에 그만큼 엄청 중요하다.
//
//	}
//
//}
